Revit 2023 API
GroupTypeId.EnergyAnalysis Property
 "Energy Analysis"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public static ForgeTypeId EnergyAnalysis { get; }
Visual Basic
Public Shared ReadOnly Property EnergyAnalysis As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ EnergyAnalysis {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace